---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsLanding.GetAllSupports
source: html/0aeb598f-bc73-c12a-20bd-29911c89a1bd.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding.GetAllSupports Method

Returns all the supports hosting the stairs landing.

## Syntax (C#)
```csharp
public IList<ElementId> GetAllSupports()
```

## Returns
All the supports hosting the stairs landings.

## Remarks
The supports consist of left, right and middle supports of the stairs landing.